{
  "title": "CCE20250929_0002",
  "source_file": "/home/runner/work/ad-res-j7/ad-res-j7/ANNEXURES/JF07/CCE20250929_0002.jpg",
  "created_at": "2025-10-21T22:00:31.114Z",
  "file_type": "markdown",
  "generated_via": "ocr",
  "sections": [
    {
      "heading": "OCR Content",
      "level": 2,
      "content": "Page 14 ABSA BANK\nPeter has never received logins FOR ABSA.\n\nAcredit card was ordered for Daniel Faucitt but it was never delivered to him. We do\nnot know who is holding and using that card?\n\nCIPC Rynette has contacted the person who the company deals with at the CIPC..\n\nCLARE. CMA@MWEBBIZ.CO.ZA Rynette contacted Clare who infomed me that\nRynette requested all the CIPC documents plus the SHARE HOLDER\nDOCUMENTS. This is information that should only be shared between Peter and |\nand thank goodness that Clare is very ethical and informed me.\n\n7.4 Page 16, 7.18 False statement by Peter. He did not have to authorise anything\nin our company. accounts, but we gave him the respect of informing him, but he stil]\nrepeatedly forgot, as can be seen in the interdict, over and over.\n\nEvery payment made has been explained and it was taken as.a company loan,\nwhich Peter knows very well and has unfortunately yet again, forgotten. The\n\ninformed several times, but maybe he cannot remember, this was because Daniel\nhad been Paying for the sustainment of platforms such as Shopify, so he could\ncontinue paying for creditors, from his personal account to keep the companies\ngoing.. Despite Peter being informed numerous times, plus his bookkeeper\nconfirming, he still put a long statement into his interdict so this is a very faise\nstatement, as he was told numerous times. .\n\nThere are so many instances of Peter being incapable of conducting his fiduciary\nduties. Because it was paid over in July Peter made an assumption that it must be\nas gift. No, that is honsense, Peter is for some reason that maybe he and his\nbookkeeper know, is trying to disqualify Dane and Jacqueline. but he is the\nincompetent one with the help of his bookkeeper. Daniel has his 2 professional\ndegrees and Jacqui Faucitt was'a nurse, then studied. medical science, human\nphysiologyy. Pete at age 73 and retired, is going to only rely on Rynette, bookkeeper\n-WHY? As he has said so many times - HE CANNOT DO IT WITHOUT HERI! 2?\nWHY, she is a bookkeeper!!",
      "subsections": []
    }
  ]
}