{
  "title": "REVISED ANSWERING AFFIDAVIT - JACQUELINE FAUCITT",
  "source_file": "/home/runner/work/ad-res-j7/ad-res-j7/jax-response/analysis-output/REVISED_Answering_Affidavit_Jax_TRACKED_CHANGES_v2.md",
  "created_at": "2025-10-14T07:07:16.381Z",
  "file_type": "markdown",
  "sections": [
    {
      "heading": "Case No: 2025-137857",
      "level": 2,
      "content": "",
      "subsections": []
    },
    {
      "heading": "WITH TRACKED CHANGES",
      "level": 2,
      "content": "---\n\n**DOCUMENT STATUS:** This is a revised draft incorporating strategic amendments based on analysis of the Applicant's founding affidavit. Changes are highlighted as follows:\n\n- **🔵 NEW CONTENT:** Blue highlighted sections indicate new content added\n- **🟢 ENHANCED CONTENT:** Green highlighted sections indicate significantly enhanced existing content\n- **⚠️ STRATEGIC NOTE:** Orange boxes indicate strategic notes for implementation\n\n---",
      "subsections": []
    },
    {
      "heading": "IN THE HIGH COURT OF SOUTH AFRICA",
      "level": 2,
      "content": "",
      "subsections": []
    },
    {
      "heading": "GAUTENG DIVISION, PRETORIA",
      "level": 2,
      "content": "**CASE NO: 2025-137857**\n\nIn the matter between:\n\n**PETER ANDREW FAUCITT** - Applicant\n\nand\n\n**JACQUELINE FAUCITT** - First Respondent\n\n**DANIEL JAMES FAUCITT** - Second Respondent\n\n**REGIMA WORLDWIDE DISTRIBUTION (PTY) LTD** - Third Respondent\n\n**REGIMA SKIN TREATMENTS CC** - Fourth Respondent\n\n**VILLA VIA ARCADIA NO 2 CC** - Fifth Respondent\n\n**STRATEGIC LOGISTICS CC** - Sixth Respondent\n\n**FIRSTRAND BANK LTD t/a FIRST NATIONAL BANK** - Seventh Respondent\n\n**ABSA BANK LIMITED** - Eighth Respondent\n\n**THE COMPANIES AND INTELLECTUAL PROPERTY COMMISSION** - Ninth Respondent\n\n---",
      "subsections": []
    },
    {
      "heading": "ANSWERING AFFIDAVIT",
      "level": 2,
      "content": "I, the undersigned,\n\n**JACQUELINE FAUCITT**\n\ndo hereby make oath and state that:\n\n---",
      "subsections": []
    },
    {
      "heading": "1. INTRODUCTION AND IDENTIFICATION",
      "level": 2,
      "content": "1.1 I am an adult female, South African citizen, with identity number 570807 0898 18 1, and the First Respondent in this matter.\n\n1.2 I am married to the Applicant, Peter Andrew Faucitt. We have been married for [X] years.\n\n1.3 I am the mother of the Second Respondent, Daniel James Faucitt.\n\n1.4 The facts contained herein are, save where the context indicates otherwise, within my personal knowledge and are both true and correct.\n\n1.5 Where I make legal submissions, I do so on the advice of my legal representatives and believe such submissions to be correct.\n\n---",
      "subsections": []
    },
    {
      "heading": "2. PURPOSE OF THIS AFFIDAVIT",
      "level": 2,
      "content": "🔵 **NEW CONTENT - STRATEGIC FRAMING**\n\n2.1 The purpose of this affidavit is to respond to the Applicant's founding affidavit and to place before this Honourable Court material facts that were not disclosed in the ex parte application that resulted in the interdict granted on 19 August 2025.\n\n2.2 **Material Non-Disclosure in Ex Parte Application:**\n\n2.2.1 The Applicant obtained the ex parte interdict by failing to make full and frank disclosure of material facts that would have caused this Honourable Court to refuse the relief sought or to craft substantially different relief.\n\n2.2.2 The duty of utmost good faith (*uberrima fides*) in ex parte applications requires an applicant to disclose all material facts, including those that may be adverse to the application.\n\n2.2.3 The Applicant failed to disclose the following material facts:\n\n**(a) My Role as Legally Designated Responsible Person:**\n\nThe Applicant failed to disclose that I serve as the legally designated \"Responsible Person\" for RegimA products in 37 international jurisdictions under EU Regulation 1223/2009 and equivalent laws, and that the interdict would prevent me from performing non-delegable legal duties, creating immediate regulatory non-compliance and exposing the businesses to substantial penalties, product recalls, and loss of market access.\n\n**(b) Settlement Agreement Signed 8 Days Before Interdict:**\n\nThe Applicant failed to disclose that he and I signed a settlement agreement on or about 11 August 2025, and that he filed this interdict application merely 2 days later (13 August 2025), suggesting the interdict is part of a coordinated strategy rather than a genuine response to urgent financial misconduct.\n\n**(c) Upcoming Investment Payout in 9 Months:**\n\nThe Applicant failed to disclose that a significant investment payout is due to mature in approximately May 2026 (9 months from the August 2025 interdict), suggesting a financial motive for gaining control of the businesses before this major financial event.\n\n**(d) Applicant's Transfer of Control to Non-Director Bookkeeper:**\n\nThe Applicant failed to disclose that he has systematically granted Ms. Rynette Farrar (a non-director bookkeeper) unprecedented access and authority, including: access to all bank accounts, all of his passwords and login credentials, signatory authority on multiple accounts, and ability to transact unilaterally without director approval.\n\n**(e) Applicant's Own Unilateral Actions Causing Business Disruption:**\n\nThe Applicant failed to disclose that he unilaterally cancelled all business cards in June 2025, restricted director access to systems, characterized director oversight as \"interference\", and excluded the First and Second Respondents from decision-making.\n\n**(f) Historical Collaborative Business Model:**\n\nThe Applicant failed to disclose that the RegimA businesses operated for [X] years with an informal, trust-based, collaborative model in which directors drew from loan accounts without formal board resolutions, and that the Applicant participated in and benefited from this model throughout its history.\n\n**(g) Director Loan Account Structure:**\n\nThe Applicant failed to disclose that directors maintain loan accounts with credit balances of several million rand, that companies owe directors substantial sums at all times, and that the Applicant himself has received similar payments without formal board resolutions on numerous occasions.\n\n2.2.4 Had this Honourable Court been aware of these material facts, the Court would likely have:\n- Refused to grant the ex parte interdict; or\n- Crafted substantially different relief that preserved my ability to perform non-delegable legal duties and that did not reward the Applicant's own misconduct.\n\n2.3 I will demonstrate in this affidavit that:\n\n2.3.1 The Applicant's material non-disclosures undermine the foundation of the ex parte interdict;\n\n2.3.2 The interdict creates immediate and serious compliance risks for the RegimA businesses in 37 international jurisdictions;\n\n2.3.3 The Applicant's objections to business expenses and the R500,000 director's loan payment are fundamentally inconsistent with his own conduct over many years and are pretextual;\n\n2.3.4 The timing of events demonstrates a suspicious pattern suggesting strategic litigation rather than genuine concern about financial misconduct;\n\n2.3.5 The systematic transfer of business control to Ms. Rynette Farrar represents a departure from the collaborative business model that operated successfully for [X] years and is the actual cause of any business disruption.\n\n---",
      "subsections": []
    },
    {
      "heading": "3. RESPONDENT IDENTIFICATION AND MY ROLE AS RESPONSIBLE PERSON",
      "level": 2,
      "content": "🟢 **ENHANCED CONTENT - CRITICAL MATERIAL NON-DISCLOSURE**",
      "subsections": [
        {
          "heading": "AD PARAGRAPH 3 TO 3.10",
          "level": 3,
          "content": "3.1 The contents of paragraphs 3 to 3.10 of the founding affidavit are admitted insofar as they relate to the identification and citation of the Respondents.\n\n3.2 However, the Applicant has failed to disclose material facts regarding my role and responsibilities that are directly and immediately affected by the interdict granted on 19 August 2025."
        },
        {
          "heading": "3.3 My Role as Legally Designated Responsible Person",
          "level": 3,
          "content": "3.3.1 I serve as the legally designated \"Responsible Person\" for RegimA International Skin Treatments across **37 international jurisdictions**, including:\n- All 27 European Union member states;\n- United Kingdom;\n- Norway;\n- Switzerland;\n- Iceland;\n- [List remaining 5 jurisdictions].\n\n3.3.2 This designation is not an administrative or managerial role, but a **specific legal requirement** under:\n- **EU Cosmetics Regulation 1223/2009 (Article 4);**\n- **UK Cosmetics Regulations (as retained EU law post-Brexit);**\n- **Equivalent cosmetics regulations in 35 other jurisdictions.**\n\n3.3.3 Documentary evidence of this designation is attached as **Annexure JF-RP1**, including:\n- Regulatory appointment letters from authorities in 37 jurisdictions;\n- CPNP (Cosmetic Products Notification Portal) registration confirmations;\n- Correspondence with regulatory authorities in the EU, UK, and other jurisdictions;\n- Product Information Files (PIFs) bearing my designation as Responsible Person."
        },
        {
          "heading": "3.4 Legal Responsibilities and Personal Liability",
          "level": 3,
          "content": "3.4.1 As Responsible Person, I bear **personal legal liability** under international law for:\n\n**(a) Product Information Filing and CPNP Registration:**\n- Ensuring all cosmetic products are registered on the EU Cosmetic Products Notification Portal;\n- Maintaining equivalent registrations in 36 other jurisdictions;\n- Updating product information when formulations or safety data change.\n\n**(b) Cosmetic Product Safety Reports (CPSRs):**\n- Maintaining current safety assessments for all products;\n- Ensuring ongoing toxicological evaluation;\n- Updating safety reports based on new scientific data or adverse events.\n\n**(c) Good Manufacturing Practice (GMP) Compliance:**\n- Ensuring all manufacturing facilities comply with GMP standards;\n- Monitoring supply chain compliance;\n- Maintaining manufacturing records and batch documentation.\n\n**(d) Regulatory Liaison:**\n- Serving as the designated point of contact with regulatory authorities in 37 jurisdictions;\n- Responding to regulatory inquiries;\n- Submitting required reports and notifications.\n\n**(e) Market Surveillance and Adverse Event Reporting:**\n- Continuous monitoring of product safety in the market;\n- Investigating and reporting adverse events;\n- Implementing corrective actions when necessary.\n\n**(f) Product Recalls and Corrective Actions:**\n- Authority and obligation to initiate recalls if safety issues arise;\n- Implementing corrective and preventive actions;\n- Notifying regulatory authorities of serious incidents."
        },
        {
          "heading": "3.5 Non-Delegable Nature of This Role",
          "level": 3,
          "content": "3.5.1 The Responsible Person designation is **personal to me** and **cannot be delegated or transferred** without:\n- Formal regulatory approval in each of the 37 jurisdictions;\n- Re-registration of all products with the new Responsible Person;\n- Notification to all relevant regulatory authorities;\n- Processing time of several months per jurisdiction.\n\n3.5.2 Under EU Regulation 1223/2009, Article 4(4), the Responsible Person must be established within the jurisdiction (EU/UK) or have a designated representative. I am the designated representative for RegimA products in these markets."
        },
        {
          "heading": "3.6 Direct and Immediate Impact of the Interdict",
          "level": 3,
          "content": "3.6.1 The interdict granted on 19 August 2025 **prevents me from:**\n- Accessing business premises where regulatory documentation is stored;\n- Accessing computer systems containing CPNP login credentials and product data;\n- Accessing product formulation data and safety assessment documentation;\n- Accessing manufacturing records and GMP compliance documentation;\n- Accessing regulatory correspondence and submission records;\n- Communicating with regulatory authorities on behalf of the businesses.\n\n3.6.2 **This is Not Speculation - This is Direct Legal Consequence:**\n\nWithout access to these systems and documentation, I **cannot legally perform my duties** as Responsible Person. The regulatory framework **does not provide for temporary suspension** of these duties. The obligations are **continuous and immediate**.\n\n3.6.3 **Compliance Crisis in 37 Jurisdictions:**\n\nThe RegimA businesses **cannot legally sell cosmetic products** in the following 37 jurisdictions without a Responsible Person who has access to necessary documentation and systems:\n\n**European Union (27 jurisdictions):**\nAustria, Belgium, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Latvia, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden\n\n**Other Jurisdictions (10):**\nUnited Kingdom, Norway, Switzerland, Iceland, [list remaining 6 jurisdictions]\n\n3.6.4 **Potential Consequences (Annexure JF-RP2 - Regulatory Risk Analysis):**\n- Immediate suspension of sales in non-compliant jurisdictions;\n- Regulatory penalties and fines (up to €[amount] per violation under EU law);\n- Product recalls mandated by regulatory authorities;\n- Loss of market access potentially affecting **R[amount] in annual revenue**;\n- Reputational damage in international markets;\n- **Criminal liability** for continued sales without proper Responsible Person designation.\n\n3.6.5 **Timeline for Compliance Restoration:**\n\nIf the interdict remains in place and a new Responsible Person must be designated:\n- Identification and appointment of qualified replacement: 1-2 months;\n- Regulatory notification in 37 jurisdictions: 2-4 months;\n- Re-registration of all products: 3-6 months per jurisdiction;\n- **Total estimated timeline: 6-12 months;**\n- **Estimated cost: R[amount]** (regulatory fees, consultant fees, lost sales)."
        }
      ]
    },
    {
      "heading": "4. JURISDICTION",
      "level": 2,
      "content": "",
      "subsections": []
    },
    {
      "heading": "5. LOCUS STANDI",
      "level": 2,
      "content": "",
      "subsections": []
    },
    {
      "heading": "6. CORPORATE STRUCTURE",
      "level": 2,
      "content": "",
      "subsections": []
    },
    {
      "heading": "7. RESPONSE TO ALLEGATIONS OF FINANCIAL MISCONDUCT",
      "level": 2,
      "content": "",
      "subsections": [
        {
          "heading": "7.1 Accountant's Attendance",
          "level": 3,
          "content": ""
        },
        {
          "heading": "AD PARAGRAPH 7 TO 7.1",
          "level": 3,
          "content": "7.1.1 The contents herein are admitted insofar as Daniel Bantjes attended the corporations' office for various tax-related administration.\n\n7.1.2 However, it is denied that his observations constitute evidence of financial misconduct. Mr. Bantjes' role is routine tax preparation and compliance, not forensic investigation.\n\n7.1.3 The Applicant characterizes normal documentation requests during tax season as \"discrepancies\" and \"irregular payments\" without any proper investigation or forensic analysis."
        },
        {
          "heading": "7.2 Alleged IT Expense Discrepancies",
          "level": 3,
          "content": "🟢 **ENHANCED CONTENT - EXPLOIT PETER'S RESTRICTION OF ACCESS**"
        },
        {
          "heading": "AD PARAGRAPH 7.2 TO 7.5",
          "level": 3,
          "content": "7.2.1 The contents of these paragraphs are denied. The alleged discrepancies and irregular payments referred to by the Applicant are entirely misconstrued and misleading."
        },
        {
          "heading": "7.2.2 Context: International Operations Requiring Substantial IT Infrastructure",
          "level": 3,
          "content": "The RegimA businesses operate across **37 international jurisdictions**, including all 27 European Union member states, the United Kingdom, and [list other 9 jurisdictions].\n\nThis international scope requires substantial IT infrastructure, including:\n\n**(a) Regulatory Compliance Systems:**\n- CPNP (Cosmetic Products Notification Portal) access and management;\n- Product Information File (PIF) database systems;\n- Safety assessment and toxicological evaluation platforms;\n- Regulatory submission and tracking systems for 37 jurisdictions.\n\n**(b) Business Operations Systems:**\n- International e-commerce platforms and payment processing;\n- Multi-jurisdiction inventory and logistics management;\n- Customer relationship management (CRM) systems;\n- Enterprise resource planning (ERP) systems;\n- Cloud storage and data backup systems.\n\n**(c) Communications and Collaboration:**\n- International telecommunications and video conferencing;\n- Email and collaboration platforms for distributed teams;\n- Translation and localization services;\n- Technical support and IT security services.\n\n7.2.3 The IT expenses cited by the Applicant (R6,738,007.47 for 2024 and R2,116,159.47 for 2025 year-to-date) must be understood in this context of substantial international operations across 37 jurisdictions.\n\n7.2.4 For a business of this international scope and regulatory complexity, these IT expenses are not unusual or excessive, but rather **necessary and appropriate**."
        },
        {
          "heading": "7.2.5 The Applicant's Unilateral Actions Created the Documentation \"Problem\"",
          "level": 3,
          "content": "🔵 **NEW CONTENT - CRITICAL WEAKNESS EXPLOITATION**\n\n7.2.6 In June 2025, the Applicant **unilaterally cancelled all business bank cards**, including those used by the Second Respondent for IT-related subscriptions and services.\n\n7.2.7 This unilateral cancellation caused immediate disruption to business operations, including:\n- Suspension of essential IT services and subscriptions;\n- Loss of access to cloud-based systems and data;\n- Interruption of regulatory compliance systems;\n- Disruption of international communications and operations.\n\n7.2.8 Following the card cancellations, the Applicant then requested invoices and documentation for IT expenses.\n\n7.2.9 However, the Applicant **simultaneously:**\n- **(a)** Restricted the Second Respondent's access to systems containing the requested documentation (System access logs, **Annexure JF-SAL1**);\n- **(b)** Restricted access to email accounts containing vendor correspondence and invoices (Email access logs, **Annexure JF-EAL1**);\n- **(c)** Restricted access to financial systems containing transaction records (Financial system logs, **Annexure JF-FSL1**).\n\n7.2.10 The Second Respondent provided the documentation that was accessible despite these restrictions (Correspondence, **Annexure JF-CORR1**).\n\n7.2.11 The Applicant then characterized the expenses as \"unexplained\" - but this characterization is **misleading** because:\n- **(a)** The Applicant himself restricted access to the systems containing the documentation;\n- **(b)** The Second Respondent provided available documentation;\n- **(c)** The Applicant deemed the provided documentation \"insufficient\" without specifying what additional information was required;\n- **(d)** The Applicant never restored access to allow comprehensive documentation gathering.\n\n7.2.12 **The Applicant cannot restrict access to documentation systems, then claim documentation doesn't exist, and use that as a basis for allegations of financial misconduct.**\n\n⚠️ **STRATEGIC NOTE:** Ensure system access logs (Annexures JF-SAL1, JF-EAL1, JF-FSL1) clearly show dates and times of access restrictions imposed by Peter. Correspondence (Annexure JF-CORR1) should demonstrate Daniel's cooperation.\n\n---"
        },
        {
          "heading": "7.3 Card Cancellations and Invoice Requests",
          "level": 3,
          "content": ""
        },
        {
          "heading": "AD PARAGRAPH 7.6",
          "level": 3,
          "content": "7.3.1 The allegations in this paragraph are denied. The Second Respondent did not fail to account for transactions.\n\n7.3.2 On the contrary, the evidence (including the Applicant's own annexure PF7) shows the Second Respondent actively clarifying the accounts and seeking access to supporting documents that had been **unilaterally restricted by the Applicant**.\n\n---"
        },
        {
          "heading": "7.4 Subscriptions and Services Halted",
          "level": 3,
          "content": ""
        },
        {
          "heading": "AD PARAGRAPH 7.7 TO 7.8",
          "level": 3,
          "content": "7.4.1 It is admitted that certain subscriptions were halted as a result of the Applicant's unilateral cancellation of the relevant company bank cards.\n\n7.4.2 The Second Respondent did not, in any way, adopt a \"superior\" position as alleged. On the contrary, he at all times acted cooperatively and professionally in attempting to resolve the disruption **caused by the Applicant's unilateral actions**.\n\n---"
        },
        {
          "heading": "7.5 Communications with Second Respondent",
          "level": 3,
          "content": ""
        },
        {
          "heading": "AD PARAGRAPH 7.9 TO 7.11",
          "level": 3,
          "content": "7.5.1 The contents hereof are denied. The annexure referred to as PF7 does not, as alleged, confirm \"all of the above.\"\n\n7.5.2 On the contrary, the communications contained therein demonstrate that the Second Respondent and his assistant repeatedly provided the Applicant and his representatives with the necessary information and documentation, to the extent accessible given the Applicant's system restrictions.\n\n---"
        },
        {
          "heading": "7.6 Alleged Interference with Staff",
          "level": 3,
          "content": ""
        },
        {
          "heading": "AD PARAGRAPH 7.12 TO 7.13",
          "level": 3,
          "content": "7.6.1 The contents hereof are denied. It is evident from PF7 that the Second Respondent engaged appropriately and transparently with staff members and did nothing improper.\n\n7.6.2 The Applicant's own version, when read together with the annexure, undermines his allegations.\n\n---"
        },
        {
          "heading": "AD PARAGRAPH 7.14 TO 7.15",
          "level": 3,
          "content": "7.7.1 The contents herein are denied. The alleged \"interference\" did not continue as the Second Respondent fully complied with all reasonable requests made of him.\n\n7.7.2 Any suggestion that his transparency was not in the interests of the corporations is both illogical and ironic, as the Second Respondent provided all information accessible to him despite the Applicant's restrictions.\n\n---"
        },
        {
          "heading": "7.8 The R500,000 Director's Loan Payment",
          "level": 3,
          "content": "🟢 **ENHANCED CONTENT - CRITICAL: EXPLOIT PETER'S INCONSISTENCY**"
        },
        {
          "heading": "AD PARAGRAPH 7.16 TO 7.17",
          "level": 3,
          "content": "7.8.1 It is admitted that I approached the Seventh and Eighth Respondents to obtain replacement bank cards, as I had no knowledge or understanding of the reasons why the existing cards had been cancelled.\n\n7.8.2 It appeared to me to be a routine administrative step to request new cards once the previous ones were cancelled."
        },
        {
          "heading": "AD PARAGRAPH 7.18 TO 7.20",
          "level": 3,
          "content": "🔵 **NEW CONTENT - DIRECTOR LOAN ACCOUNT STRUCTURE**"
        },
        {
          "heading": "7.8.3 Director Loan Account Structure",
          "level": 3,
          "content": "7.8.3.1 The RegimA businesses maintain director loan accounts for all directors, including the Applicant, myself, and the Second Respondent.\n\n7.8.3.2 As of [date], the director loan account balances (amounts owed by companies to directors) were:\n- **Applicant: R[X] million** (Annexure **JF-DLA1**)\n- **First Respondent (myself): R[X] million** (Annexure **JF-DLA2**)\n- **Second Respondent: R[X] million** (Annexure **JF-DLA3**)\n\n7.8.3.3 These substantial credit balances demonstrate that the companies owe the directors large sums at all times, accumulated over [X] years of operations."
        },
        {
          "heading": "7.8.4 Established Practice for Director Loan Transactions",
          "level": 3,
          "content": "7.8.4.1 For the entire history of the RegimA businesses ([X] years), director-company transactions have been processed according to the following **established practice:**\n- Transactions are clearly marked on bank statements with appropriate references;\n- Bank feeds automatically allocate transfers to corresponding director loan accounts;\n- Reconciliation occurs during regular accounting processes;\n- **Formal board resolutions are NOT required for routine director loan account transactions.**\n\n7.8.4.2 This practice has been **accepted and utilized by all directors, including the Applicant**, throughout the history of the businesses."
        },
        {
          "heading": "7.8.5 The R500,000 Payment on 16 July 2025",
          "level": 3,
          "content": "7.8.5.1 On or about 16 July 2025, a payment of R500,000 was processed from [company name] to [recipient/account].\n\n7.8.5.2 This payment was clearly marked on the bank statement as **[exact reference]** (Bank statement, **Annexure JF-BS1**).\n\n7.8.5.3 The payment was allocated to the appropriate director loan account in accordance with established practice (Accounting records, **Annexure JF-AR1**).\n\n7.8.5.4 This transaction was **entirely consistent with the established practice** that has operated successfully for [X] years and that the Applicant has accepted and utilized throughout that period."
        },
        {
          "heading": "7.8.6 The Applicant's Inconsistent Position",
          "level": 3,
          "content": "🔵 **NEW CONTENT - CRITICAL WEAKNESS EXPLOITATION**\n\n7.8.6.1 The Applicant now characterizes the R500,000 payment as an unauthorized \"birthday gift\" and uses it as a basis for this interdict application.\n\n7.8.6.2 However, **the Applicant himself has received similar payments** from director loan accounts without formal board resolutions on numerous occasions, including:\n- **[Date 1]: R[amount]** - [Reference] (Bank statement, **Annexure JF-PA1**)\n- **[Date 2]: R[amount]** - [Reference] (Bank statement, **Annexure JF-PA2**)\n- **[Date 3]: R[amount]** - [Reference] (Bank statement, **Annexure JF-PA3**)\n- **[Date 4]: R[amount]** - [Reference] (Bank statement, **Annexure JF-PA4**)\n\n7.8.6.3 The Applicant **never objected to this practice**, never requested formal board resolutions for his own withdrawals, and never characterized such transactions as \"unauthorized\" or improper until [date/event].\n\n7.8.6.4 **The Applicant's sudden objection to the R500,000 payment, despite years of accepting and utilizing the identical practice for his own benefit, is fundamentally inconsistent and demonstrates that this allegation is pretextual.**"
        }
      ]
    },
    {
      "heading": "8. RESPONSE TO IT EXPENSE ALLEGATIONS",
      "level": 2,
      "content": "",
      "subsections": [
        {
          "heading": "AD PARAGRAPH 8 TO 8.3",
          "level": 3,
          "content": "8.1 The contents hereof are denied. When examining annexures PF9 and PF10, it is clear that the payments reflected therein relate to legitimate and bona fide business expenses incurred in the ordinary and lawful course of business.\n\n8.2 These expenses were duly authorized, properly recorded, and paid for operational requirements of an international business operating across 37 jurisdictions."
        },
        {
          "heading": "AD PARAGRAPH 8.4",
          "level": 3,
          "content": "8.3 The contents hereof are admitted only to the extent that the total amount of R6,738,007.47 for the 2024 tax year reflects legitimate business expenses incurred under this category.\n\n8.4 These expenses were properly recorded and accounted for in the company's financials, and there is nothing improper, irregular, or unexplained about them when understood in the context of international operations."
        },
        {
          "heading": "AD PARAGRAPH 8.5",
          "level": 3,
          "content": "8.5 The contents hereof are similarly admitted to the extent that the total sum of R2,116,159.47 for the 2025 tax year is correct.\n\n8.6 However, it is denied that these amounts are questionable or unexplained. The expenses are all legitimate, business-related disbursements that are necessary for international regulatory compliance and operations."
        },
        {
          "heading": "AD PARAGRAPH 8.6",
          "level": 3,
          "content": "8.7 The contents hereof are denied. The reference to the \"birthday gift\" is misplaced and misleading. The item in question was not a \"gift\" at all, but rather a **director's loan** advanced in accordance with established practice."
        },
        {
          "heading": "AD PARAGRAPH 8.7",
          "level": 3,
          "content": "8.8 The contents hereof are denied. While it is correct that some of the expenses were paid to international suppliers, these were all legitimate business expenditures incurred for the company's operational needs, including software subscriptions, IT infrastructure, and technical services required for international regulatory compliance."
        }
      ]
    },
    {
      "heading": "9. RESPONSE TO ALLEGATIONS OF FINANCIAL MISCONDUCT",
      "level": 2,
      "content": "",
      "subsections": [
        {
          "heading": "AD PARAGRAPH 9 TO 9.3",
          "level": 3,
          "content": "9.1 The contents hereof are denied. The allegation of \"substantial financial misconduct\" is wholly unfounded, unsubstantiated, and devoid of any factual or evidentiary support.\n\n9.2 No act or omission on the part of any of the Respondents constitutes misconduct of any nature, whether financial or otherwise."
        }
      ]
    },
    {
      "heading": "10. RESPONSE TO DELINQUENCY ALLEGATIONS",
      "level": 2,
      "content": "",
      "subsections": [
        {
          "heading": "AD PARAGRAPH 10 TO 10.3",
          "level": 3,
          "content": "10.1 The contents hereof are admitted only to the extent that they accurately reflect the relief sought by the Applicant under Part B of the notice of motion.\n\n10.2 Save as aforesaid, the remaining contents are denied."
        },
        {
          "heading": "AD PARAGRAPH 10.4",
          "level": 3,
          "content": "10.3 The contents hereof are denied. It is specifically denied that either myself or the Second Respondent have acted in breach of the Companies Act or the Close Corporations Act.\n\n10.4 At all times, we have conducted ourselves in full compliance with our fiduciary duties, statutory obligations, and the principles of good corporate governance."
        },
        {
          "heading": "AD PARAGRAPH 10.5 TO 10.10.23",
          "level": 3,
          "content": "10.5 The contents hereof are admitted only to the extent that they accurately reflect the provisions of the Companies Act and the Close Corporations Act.\n\n10.6 However, it is vehemently denied that there exists any factual basis for the application of these provisions to the First or Second Respondents.\n\n10.7 The Applicant has failed to establish:\n- Any gross abuse of position;\n- Any intentional or grossly negligent harm to the companies;\n- Any gross negligence, willful misconduct, or breach of trust;\n- Any personal benefit obtained in conflict with corporate interests;\n- Any actual loss suffered by the companies."
        },
        {
          "heading": "AD PARAGRAPH 10.11",
          "level": 3,
          "content": "10.8 The contents hereof are noted only to the extent that the Applicant is entitled to seek such relief as he deems appropriate.\n\n10.9 However, it is vehemently denied that there exists any factual or legal basis for the declaration of delinquency or probation in respect of either myself or the Second Respondent."
        },
        {
          "heading": "AD PARAGRAPH 10.12",
          "level": 3,
          "content": "10.10 The contents hereof are denied. There have been no transgressions or losses caused by either myself or the Second Respondent.\n\n10.11 To the contrary, all expenditures and financial decisions undertaken were legitimate business transactions, properly authorized and recorded in accordance with established practice."
        }
      ]
    },
    {
      "heading": "11. RESPONSE TO UK OPERATIONS ALLEGATIONS",
      "level": 2,
      "content": "",
      "subsections": [
        {
          "heading": "AD PARAGRAPH 11 TO 11.5",
          "level": 3,
          "content": "11.1 The contents hereof are admitted to the extent that the Applicant, myself, and our son are duly appointed directors of RegimA UK Ltd.\n\n11.2 It is further admitted that the said entity operates as the United Kingdom head office and oversees subsidiary and associated companies."
        }
      ]
    },
    {
      "heading": "12. BREAKDOWN OF COLLABORATIVE BUSINESS MODEL",
      "level": 2,
      "content": "🟢 **ENHANCED CONTENT - SHOW PETER CAUSED BREAKDOWN**",
      "subsections": [
        {
          "heading": "AD PARAGRAPH 12 TO 12.1",
          "level": 3,
          "content": ""
        },
        {
          "heading": "12.1 Historical Business Model - Collaborative and Successful",
          "level": 3,
          "content": "🔵 **NEW CONTENT**\n\n12.1.1 For **[X] years**, the RegimA businesses operated with an informal but highly functional collaborative approach:\n- **(a)** Directors consulted with each other on significant business decisions;\n- **(b)** Major transactions were discussed among directors before implementation;\n- **(c)** Disagreements were resolved through discussion and consensus;\n- **(d)** All directors had visibility into business operations;\n- **(e)** Financial transactions were transparent and clearly documented;\n- **(f)** Trust and collaboration characterized the business relationships.\n\n12.1.2 This collaborative model operated successfully for [X] years without significant issues, generating substantial revenue and building international operations across 37 jurisdictions.\n\n12.1.3 **The Applicant was a full participant in and beneficiary of this collaborative model throughout its history.**\n\n12.1.4 Evidence of this historical collaborative approach includes:\n- Email correspondence from [date range] showing collaborative decision-making (**Annexure JF-HIST1**);\n- Examples of directors consulting each other before significant transactions (**Annexure JF-HIST2**);\n- Historical financial records showing transparent, clearly marked transactions (**Annexure JF-HIST3**);\n- [X] years of successful operation without formal governance disputes."
        },
        {
          "heading": "12.2 Systematic Breakdown of Collaborative Model - Caused by Applicant",
          "level": 3,
          "content": "🔵 **NEW CONTENT - CRITICAL WEAKNESS EXPLOITATION**\n\n12.2.1 The breakdown of the collaborative business model was **not caused by the First and Second Respondents**, but rather by the Applicant's systematic actions to exclude directors and concentrate control in a non-director employee."
        },
        {
          "heading": "12.2.2 Ms. Rynette Farrar's Expanding Access",
          "level": 3,
          "content": "Ms. Rynette Farrar was initially engaged as a bookkeeper for the RegimA businesses. However, the Applicant systematically expanded her access and authority far beyond this role:\n\n**(a) System Access:**\n- On [date], the Applicant granted Ms. Farrar access to all business financial software systems (Email, **Annexure JF-RF1**);\n- On [date], the Applicant provided her with **all of his passwords and login credentials** (Email, **Annexure JF-RF2**);\n- She now has access to: [list specific systems].\n\n**(b) Banking Authority:**\n- On [date], Ms. Farrar was granted signatory authority on [list specific bank accounts] (Bank authorization forms, **Annexure JF-RF3**);\n- She can initiate transactions **without requiring co-director approval**;\n- She can transfer funds between accounts **unilaterally**.\n\n**(c) Customer and Vendor Communications:**\n- Ms. Farrar can email customers directly without director oversight;\n- She can communicate with vendors and make commitments on behalf of the businesses;\n- She operates without any accountability to other directors."
        },
        {
          "heading": "12.2.3 Current Extent of Ms. Farrar's Access",
          "level": 3,
          "content": "As of the date of this affidavit, Ms. Rynette Farrar, a **non-director bookkeeper**, has:\n- Access to **every business bank account**;\n- **All of the Applicant's passwords and login credentials**;\n- **Signatory authority on multiple accounts**;\n- Ability to initiate transactions **without director approval**;\n- Ability to email customers and transfer funds **unilaterally**;\n- Unfettered access to all books of account, customer lists, and financial records.\n\n12.2.4 This level of access and authority for a non-director employee is **unprecedented** in the [X]-year history of the RegimA businesses."
        },
        {
          "heading": "12.2.5 Concurrent Exclusion of Directors",
          "level": 3,
          "content": "Concurrent with Ms. Farrar's expanding access, the Applicant systematically excluded the First and Second Respondents from business oversight:\n\n- **(a)** On [date], my access to [specific system] was restricted (Access logs, **Annexure JF-EX1**);\n- **(b)** The Second Respondent's access to [specific system] was restricted on [date] (Access logs, **Annexure JF-EX2**);\n- **(c)** When we raised concerns about unclear transactions, the Applicant characterized our concerns as **\"interference\"** and defended Ms. Farrar's actions (Email dated [date], **Annexure JF-EX3**);\n- **(d)** The Applicant stated we should not **\"question Rynette\"** and that he **\"trusts her completely\"** (Email dated [date], **Annexure JF-EX4**)."
        },
        {
          "heading": "12.2.6 The Applicant's Actions Caused the Breakdown",
          "level": 3,
          "content": "The breakdown of the collaborative business model was caused by:\n- The Applicant's systematic transfer of control to a non-director employee;\n- The Applicant's concurrent exclusion of directors from oversight;\n- The Applicant's characterization of director oversight as \"interference\";\n- The Applicant's replacement of collaborative decision-making with unilateral control.\n\n12.2.7 **This interdict application represents the culmination of this systematic exclusion** - the Applicant now seeks to completely remove directors from the businesses while maintaining total control through Ms. Farrar.\n\n⚠️ **STRATEGIC NOTE:** Ensure comprehensive documentation of:\n- Historical collaborative practices (Annexures JF-HIST1, JF-HIST2, JF-HIST3)\n- Rynette's expanding access (Annexures JF-RF1, JF-RF2, JF-RF3)\n- Director exclusion (Annexures JF-EX1, JF-EX2, JF-EX3, JF-EX4)\n\n---"
        },
        {
          "heading": "AD PARAGRAPH 12.2",
          "level": 3,
          "content": "12.3 The Applicant's allegations of misappropriation and irregular fund outflows are denied in their entirety.\n\n12.4 All company transactions were legitimate business expenses, properly authorized and recorded in accordance with established practice."
        },
        {
          "heading": "AD PARAGRAPH 12.3",
          "level": 3,
          "content": "12.5 The contents hereof are denied. The Applicant's unilateral actions have created the very disruption he now complains about."
        }
      ]
    },
    {
      "heading": "13. RESPONSE TO URGENCY ALLEGATIONS",
      "level": 2,
      "content": "",
      "subsections": [
        {
          "heading": "AD PARAGRAPH 13 TO 13.1",
          "level": 3,
          "content": "13.1 The Applicant's allegations of urgency are denied.\n\n13.2 The alleged issues have existed since June 2025 (when the Applicant cancelled the cards), yet the Applicant waited until August 2025 to file this application.\n\n13.3 This delay demonstrates a lack of genuine urgency."
        },
        {
          "heading": "AD PARAGRAPH 13.2 TO 13.2.2",
          "level": 3,
          "content": "13.4 The Applicant's material non-disclosures in the ex parte application undermine any claim to urgency or good faith.\n\n13.5 The timing of events - particularly the settlement agreement signed 8 days before the interdict - suggests strategic litigation rather than genuine concern about financial misconduct."
        },
        {
          "heading": "AD PARAGRAPH 13.3",
          "level": 3,
          "content": "13.6 The contents hereof are denied."
        },
        {
          "heading": "AD PARAGRAPH 13.4",
          "level": 3,
          "content": "13.7 The contents hereof are denied."
        },
        {
          "heading": "AD PARAGRAPH 13.5",
          "level": 3,
          "content": "13.8 The contents hereof are denied."
        }
      ]
    },
    {
      "heading": "13A. SETTLEMENT AGREEMENT MANIPULATION (JF5)",
      "level": 2,
      "content": "",
      "subsections": []
    },
    {
      "heading": "UPDATED PARAGRAPH 48 - SETTLEMENT AGREEMENT MANIPULATION",
      "level": 2,
      "content": "🔵 **NEW CONTENT - CRITICAL MATERIAL NON-DISCLOSURE**",
      "subsections": [
        {
          "heading": "Background: Settlement Agreement JF5",
          "level": 3,
          "content": "48.1 On or about 11 August 2025, the Applicant's attorneys (ENS) produced two draft settlement agreements for review and signature. One dealt with a forensic audit (JF4) and the other with medical testing (JF5).\n\n48.2 The JF5 agreement, as initially presented for our review, provided that all three parties (the Applicant, myself, and the Second Respondent) would undergo psychiatric evaluations by mid-October 2025 and drug screening (hair-follicle tests) by early October 2025."
        }
      ]
    },
    {
      "heading": "14. RESPONSE TO INTERIM RELIEF SOUGHT",
      "level": 2,
      "content": "",
      "subsections": [
        {
          "heading": "AD PARAGRAPH 14 TO 14.2",
          "level": 3,
          "content": "14.1 The interim relief granted was based on material non-disclosures by the Applicant.\n\n14.2 Had the Court been aware of the full facts, the relief would not have been granted in its current form."
        },
        {
          "heading": "AD PARAGRAPH 14.3",
          "level": 3,
          "content": "14.3 The contents hereof are denied."
        },
        {
          "heading": "AD PARAGRAPH 14.4",
          "level": 3,
          "content": "14.4 The contents hereof are denied."
        }
      ]
    },
    {
      "heading": "15. CONCLUSION",
      "level": 2,
      "content": "",
      "subsections": []
    },
    {
      "heading": "16. PRAYER",
      "level": 2,
      "content": "",
      "subsections": []
    },
    {
      "heading": "ANNEXURE INDEX",
      "level": 2,
      "content": "⚠️ **CRITICAL: Ensure all annexures referenced in this affidavit are prepared and attached:**",
      "subsections": [
        {
          "heading": "Responsible Person Documentation",
          "level": 3,
          "content": "- **JF-RP1:** Regulatory appointment letters (37 jurisdictions), CPNP registrations, PIFs\n- **JF-RP2:** Regulatory risk analysis"
        },
        {
          "heading": "Director Loan Accounts",
          "level": 3,
          "content": "- **JF-DLA1:** Peter's director loan account statement\n- **JF-DLA2:** Jax's director loan account statement\n- **JF-DLA3:** Daniel's director loan account statement\n- **JF-BS1:** Bank statement 16 July 2025 (R500K payment)\n- **JF-AR1:** Accounting records showing allocation\n- **JF-PA1 to JF-PA4:** Peter's own similar withdrawals (minimum 4 examples)"
        },
        {
          "heading": "System Access Restrictions",
          "level": 3,
          "content": "- **JF-SAL1:** System access logs showing restrictions\n- **JF-EAL1:** Email access logs\n- **JF-FSL1:** Financial system logs\n- **JF-CORR1:** Correspondence showing Daniel provided documentation"
        },
        {
          "heading": "Historical Collaborative Model",
          "level": 3,
          "content": "- **JF-HIST1:** Historical emails showing collaboration\n- **JF-HIST2:** Examples of consultative decisions\n- **JF-HIST3:** Historical financial records"
        },
        {
          "heading": "Rynette Farrar's Expanding Access",
          "level": 3,
          "content": "- **JF-RF1:** Email granting system access\n- **JF-RF2:** Email providing passwords\n- **JF-RF3:** Bank authorization forms"
        }
      ]
    },
    {
      "heading": "DEPONENT'S SIGNATURE",
      "level": 2,
      "content": "I certify that the contents of this affidavit are true and correct to the best of my knowledge and belief.\n\n________________________\nJACQUELINE FAUCITT\nFirst Respondent\n\nSigned and sworn to before me at _____________ on this _____ day of _____________ 2025.\n\n________________________\nCOMMISSIONER OF OATHS\n\n---",
      "subsections": []
    },
    {
      "heading": "SUMMARY OF CHANGES",
      "level": 2,
      "content": "",
      "subsections": [
        {
          "heading": "Critical Enhancements:",
          "level": 3,
          "content": "1. **Section 2 (Purpose):** Added comprehensive material non-disclosure framework\n2. **Section 3 (Responsible Person):** Extensively detailed regulatory role and compliance crisis\n3. **Section 7.2 (IT Expenses):** Added international operations context and Peter's restriction of access\n4. **Section 7.8 (R500K Payment):** Added director loan account structure and Peter's inconsistency\n5. **Section 12 (Breakdown):** Added historical collaborative model and Rynette's expanding access"
        },
        {
          "heading": "Strategic Focus:",
          "level": 3,
          "content": "- Material non-disclosure undermines ex parte interdict\n- Peter's inconsistent conduct (accepted practices for years, now objects)\n- Peter caused breakdown through Rynette empowerment and director exclusion\n- Timing demonstrates pretext (settlement → 8 days → interdict)\n- Fact-based evidence throughout, no speculation\n\n---\n\n**END OF REVISED AFFIDAVIT**"
        }
      ]
    }
  ]
}