{
  "title": "CCE20250929_0005",
  "source_file": "/home/runner/work/ad-res-j7/ad-res-j7/ANNEXURES/JF07/CCE20250929_0005.jpg",
  "created_at": "2025-10-21T22:00:26.697Z",
  "file_type": "markdown",
  "generated_via": "ocr",
  "sections": [
    {
      "heading": "OCR Content",
      "level": 2,
      "content": "sort out the mess left by Peter. Ask him to prove the documents and the moniees he\ncost the UK company. When did Peter last go to the UK , meet the staff and inspect\nthe fulfilment house where the stock is held. It is busy in the UK but Peter would not\nknow as he would not remember the next day, sadly\n\nAD Interdicts in the notice of motion\n\nIn this respect Peter is not telling the truth. All these statements are nonsense.\nFinancial investigation. This must be done of the bookkeeper in SA as she has\nmisappropriated millions, including the money left by Kayla Pretorius, Daniel's\npartner who was murdered, which can be verified. Money that Kayla inherited from\nher late father has been misappropriated by RYNETTE as well. This was shown\nseveral times to Peter, with no action.\n\n16.2 what does Peter know about the UK business? Nothing\n\nPeter is still talking about the.5,000 in SA (company loan from Daniel's company)\nalthough it has been explained so many times —\n\n16.4\n\nWhy does Peter still claim to be in a state of Shock, that will be his dementia as IT IS\nABLATANT LIE. Daniel and Jacquelin are still in shock because of the horrendous\ntheft by bookkeeper, Rynette Farrar. He is trying to cause a smoke screen to cover\nfor Rynette as there are millions now missing from our SA accounts. This is\nfollowing the shock of the Friday afternoon when the Sheriff came to the door and\nPeter thought it was very funny to inform Jacqueline the Sheriff was there for her in\nthe kitchen. He claimed not to know he was coming, another fie and very funny to\nPeter.\n\n16.3 16.8, 16.9 it must be noteworthy that every day that passes whilst Rynette is in\nour REGIMA offices not being overseen, exposed to REGIMA accounts, then she is\n\nsuspend her\n\n16.3 the funds leaving the accounts is ail from the actions of RYNETTE,\nproven.16.10, 16.11 RYNETTE IS THE ONE CONCEALING REGIMA monies\n\nThe Honourable court with respect must please note that only RYNETTE, the\nbookkeeper has been able to see the accounts as they are now on PASTEL that\nneither DANIEL, nor JACQUELINE are privvy to, 16.11\n\nRynette has hidden fortunes of RegimA money within some of the RegimA accounts\naccounts, which can and will be proven.",
      "subsections": []
    }
  ]
}