{
  "title": "CCE20250929_0003",
  "source_file": "/home/runner/work/ad-res-j7/ad-res-j7/ANNEXURES/JF07/CCE20250929_0003.jpg",
  "created_at": "2025-10-21T22:00:29.618Z",
  "file_type": "markdown",
  "generated_via": "ocr",
  "sections": [
    {
      "heading": "OCR Content",
      "level": 2,
      "content": "There was little source of income at that time as Peter had my personal account\nfrozen as well as all the company accounts. This woman, Rynette Farrar, was then\nin contro! of all our finances, terrible.\n\n8,8 is a blatant lie about the money from J Faucitt.. It must be noted that all the\nRegimA Global Accounts have.been drained by Rynette Farrar,\n\nThe audit, was requested by Daniel so many times, but no requests from Peter to\ninvestigate Rynette Farrar. Peter is being hoodwinked, mainly because he has a\nprobable memory problem, which is getting worse by the day.\n\nDaniel has requested many times during 2025 that Rynette has made so many\nfraudulent action,s so she needs to be audited. As she has submitted fraudulent\ndocuments to SARS and to other financial companies.\n\n9.1 Rynette Farrar to be investigated due to enormous fraudulent activity in all the\nREGIMA bank accounts. This was pointed out to Danie Bantjie who has done\nnothing and said he was going on holiday when most of the fraud was brought to\nlight. He needs to be called to court to question in the court and answer that he\nreceived the extensive reports from Daniel.\n\n9.3 Rynette to be investigated on all her fraudulent transactions, which are\nnumerous. Only in the week ending Friday, 26 September it was noted that\nRYNETTE had removed millions from the FIRST NATIONAL BANK accounts, which\nwere always controlled by JACQUELINE FAUGITT. Peter was informed. Jacqueline\nstated she was going to go to the REGIMA OFFICES to ask RYNETTE about all the\nmoney. Peter came back tothe house and threatened Jacqueline if she was to\nattempt to go to the office that he would go beserk and prevent her from going and\nreminded Jacqueline about the interdict. This conduct is shocking and frightening so\nJacqueline did not pursue it. ?\n\nWhy would Peter at age 73, be defending this woman who ‘stole’ the RegimA brand\nand the e-mails and the money — Why?, so she has given the REGIMA IP away to\nher son and her for the company they share online. 10.5.\n\nFor Peter to claim Daniel, who holds an electrical engineering / automation degree\nand a degree in Applied Mathematics, honours, cum laude degree, Peter and\nJacqueline, both much higher qualified than the bookkeeper, to state we are\ndelinquent, which is extremely offensive, especially because Rynette has taken so",
      "subsections": []
    }
  ]
}