{
  "title": "CCE20250929_0004",
  "source_file": "/home/runner/work/ad-res-j7/ad-res-j7/ANNEXURES/JF07/CCE20250929_0004.jpg",
  "created_at": "2025-10-21T22:00:27.996Z",
  "file_type": "markdown",
  "generated_via": "ocr",
  "sections": [
    {
      "heading": "OCR Content",
      "level": 2,
      "content": "much from our companies. 10.5.1,10.2 Why is he defending this slightly qualified\nwoman, who is bleeding the REGIMA companies dry?\n\n10.6.1.2.3 Peter has put his own interests. before any of the companies and with\nRynette, boonkkeeper, Peter is guilty of wilful gross misconduct and must be\ndisqualified as a Director as he has neglected his fiduciary duties.10.10.1. which is\nprobably because of a lapse in memory, which RYNETTE is taking full advantage of.\n\nPeter has been told and shown evidence of the financial fraud conducted by Rynette.\nIt must be remembered that Peter does not and cannot use a computer, and cannot\ndo anything financial.\n\nThe statements where Peter is claiming his wife and:son are negligent are biatant\nlies as he tries to cover for all the fraud committed by the bookkeeper. We request\nthe court to please look at the true evidence, not Peter’s brain-fog lies, considering\nhe cannot use a computer and so does no banking whatsoever, she is totally in\ncontrol of REGIMA banking.\n\nWe need Peter to put the accounts back to what they were before the interdict as\nthere are MILLIONS more now missing, which he needs to explain but won't be able\nto do so.\n\n11.6\n\nThe UK REGIMA COMPANY IS CONTROLLED AND RUN BEAUTIFULLY BY Daniel\nFaucitt as it is automated and he has a team of staff who have been with REGIMA\nfor many years. The automating platforms have been run by Daniel, so RegimA SA\nOWES UK money for the automation and running fees\n\n11.9 Peter has nothing to do with the UK company so knows zero about it. He owes\nmoney but is just once again making claims that cannot be substantiated.\n\n12.1, 14.3,14.5\n\nThe UK COMPANY is fully automated and runs smoothly. Peter just chooses not to\nhear how it works but instead likes to make claims. Unfortunately, it was Peter who\nsigned a 20 year agreement with a Belgian business man and left Daniel to try and",
      "subsections": []
    }
  ]
}